src/ПодсистемаPAPI/Catalogs/PAPI_ЧтениеСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>PAPI_ЧтениеСообщений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ТипВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_Участники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналОтвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PAPI_КаналыИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ТипВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>PAPI_ТипВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алгоритм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/Catalogs/PAPI_ЧтениеСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда 
		
		// Создан копированием++
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
			И ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.PAPI_ЧтениеСообщений") Тогда	
			
			ПриЧтенииНаСервере(Параметры.ЗначениеКопирования);
				
		КонецЕсли;
		// Создан копированием--
	
		Если Не ЗначениеЗаполнено(Объект.ТипВыполнения) Тогда 
			Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.Произвольный;
		КонецЕсли;
		
	КонецЕсли; 
	
	ВидимостьИДоступностьЭлементов();

КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не ТекущийОбъект.ЭтоГруппа Тогда

		СтруктураНастройки = PAPI_РаботаСВходящимиСообщениями.СтруктураНастроекЧтенияСообщений(ТекущийОбъект.Настройки);

		Если СтруктураНастройки.Свойство("СП_КодВыполнения") Тогда
			КодВыполнения = СтруктураНастройки.СП_КодВыполнения;	
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.ЭтоГруппа Тогда
		ПоместитьСтруктураЧтенияСообщений(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВыполненияПриИзменении(Элемент)
	ВидимостьИДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора <> Неопределено Тогда 
		Если ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") Тогда		
			Если ИсточникВыбора.ИмяФормы = "Обработка.PAPI_КонсольКода.Форма.Форма" Тогда				
				КодВыполнения = ВыбранноеЗначение;
				Модифицированность = Истина;
			КонецЕсли;			
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодВыполненияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПарамОткрытия = Новый Структура;
	ПарамОткрытия.Вставить("Заголовок", "Алгоритм чтения сообщения");
	ПарамОткрытия.Вставить("ТекстАлгоритма", Элемент.ТекстРедактирования);	
	ПарамОткрытия.Вставить("РежимВыбора", Истина);	
	
	ОткрытьФорму("Обработка.PAPI_КонсольКода.Форма.Форма", 
			ПарамОткрытия, 
			ЭтотОбъект, 
			, 
			, 
			, 
			, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоместитьСтруктураЧтенияСообщений(ТекущийОбъект)
		
// СтруктураЧтенияСообщений ++		                    
	СтруктураДанных = Новый Структура;
	СтруктураЧтенияСообщений = Новый Структура;
	СтруктураЧтенияСообщений.Вставить("КодВыполнения", КодВыполнения);
		
	СтруктураДанных.Вставить("СтруктураЧтенияСообщений", СтруктураЧтенияСообщений);
// СтруктураЧтенияСообщений --

	ДанныеXML = PAPI_ОбщегоНазначенияВызовСервера.СериализаторXML(СтруктураДанных);
	ТекущийОбъект.Настройки = Новый ХранилищеЗначения(?(ДанныеXML.Отработал, ДанныеXML.Результат,""));
	
КонецПроцедуры 

&НаСервере
Процедура ВидимостьИДоступностьЭлементов()

	Элементы.Алгоритм.Видимость 					=  Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.Алгоритм;
	Элементы.КодВыполнения.Видимость 				=  Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.Произвольный;
	//Элементы.ГруппаВнешняяОбработка.Видимость 		=  Объект.ТипВыполнения = Перечисления.PAPI_ТипВыполнения.ВнешняяОбработка;
	
КонецПроцедуры	

#КонецОбласти
